{
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-Product",
    "2": "I-Product",
    "3": "B-PRICE",
    "4": "I-PRICE",
    "5": "B-LOC",
    "6": "I-LOC",
    "7": "B-CONTACT_INFO",
    "8": "I-CONTACT_INFO"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CONTACT_INFO": 7,
    "B-LOC": 5,
    "B-PRICE": 3,
    "B-Product": 1,
    "I-CONTACT_INFO": 8,
    "I-LOC": 6,
    "I-PRICE": 4,
    "I-Product": 2,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
